package main

// import "fmt"

// func main() {
// 	// 深拷贝：复制一个变量时，会创建一个新的变量并将原始的数据赋值给新的变量，新变量的内存是一个新的地址
// 	// 浅拷贝：复制一个变量时，会创建一个新的变量并将原始的数据赋值给新的变量，新变量的内存是一个相同的地址

// 	var s1 = []int{1, 2, 34, 53, 21, 32, 21, 32, 21, 32, 21, 32, 21, 32, 21, 32, 21, 32, 21, 32, 21, 32, 21, 32, 21}
// 	// s2 := s1
// 	// fmt.Println("s1:", s1)
// 	// fmt.Println("s2:", s2)
// 	// s1[1] = 100
// 	// fmt.Println("修改后的s1:", s1)
// 	// fmt.Println("修改后的s2:", s2)

// 	// 深拷贝 -- copy()
// 	s3 := make([]int, len(s1), cap(s1))
// 	copy(s3, s1)
// 	fmt.Println("s3:", s3)
// 	s1[1] = 200
// 	fmt.Println("修改后的s1:", s1)
// 	fmt.Println("修改后的s3:", s3)
// }
